#### Terraform dev Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
module.media_api.data.archive_file.media_uploads: Reading...
module.media_api.data.archive_file.media_uploads: Read complete after 0s [id=ab5e335f198e5fee406cc2ba14b8806f46cfba85]
module.media_api.data.aws_region.current: Reading...
module.identity_pool.data.aws_region.current: Reading...
module.media_api.aws_cloudwatch_log_group.lambda["create_upload_record"]: Refreshing state... [id=/aws/lambda/cloud-photos-dev-create-upload-record]
module.media_api.aws_iam_role.delete_upload_record: Refreshing state... [id=cloud-photos-dev-delete-upload-record-role]
module.media_api.aws_cloudwatch_log_group.lambda["get_upload_records"]: Refreshing state... [id=/aws/lambda/cloud-photos-dev-get-upload-records]
module.media_api.data.aws_caller_identity.current: Reading...
module.media_storage.data.aws_caller_identity.current: Reading...
module.media_api.aws_cloudwatch_log_group.lambda["delete_upload_record"]: Refreshing state... [id=/aws/lambda/cloud-photos-dev-delete-upload-record]
module.media_db.aws_dynamodb_table.upload_records: Refreshing state... [id=cloud-photos-upload-records-dev]
module.identity_pool.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.media_api.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.media_api.aws_iam_role.create_upload_record: Refreshing state... [id=cloud-photos-dev-create-upload-record-role]
module.media_api.aws_iam_role.get_upload_records: Refreshing state... [id=cloud-photos-dev-get-upload-records-role]
module.media_api.data.aws_caller_identity.current: Read complete after 0s [id=***]
module.cognito.aws_cognito_user_pool.main: Refreshing state... [id=ap-northeast-1_MqADoAEeB]
module.media_storage.data.aws_caller_identity.current: Read complete after 0s [id=***]
module.media_api.aws_api_gateway_rest_api.media: Refreshing state... [id=vtz8vfq85g]
module.media_storage.aws_s3_bucket.media: Refreshing state... [id=***-cloud-photos-media-dev]
module.media_api.aws_iam_role_policy.get_upload_records_logs: Refreshing state... [id=cloud-photos-dev-get-upload-records-role:cloudwatch-logs]
module.media_api.aws_iam_role_policy.delete_upload_record_logs: Refreshing state... [id=cloud-photos-dev-delete-upload-record-role:cloudwatch-logs]
module.media_api.aws_iam_role_policy.create_upload_record_logs: Refreshing state... [id=cloud-photos-dev-create-upload-record-role:cloudwatch-logs]
module.media_api.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-vtz8vfq85g-DEFAULT_4XX]
module.media_api.aws_api_gateway_resource.media: Refreshing state... [id=eh1ehu]
module.media_api.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-vtz8vfq85g-DEFAULT_5XX]
module.cognito.aws_cognito_user_pool_client.main: Refreshing state... [id=3uf318v7h781gvs5rbrf7af932]
module.media_api.aws_api_gateway_resource.uploads: Refreshing state... [id=v3prx5]
module.media_api.aws_api_gateway_resource.upload_item: Refreshing state... [id=xbfdej]
module.media_api.aws_api_gateway_method.post_uploads: Refreshing state... [id=agm-vtz8vfq85g-v3prx5-POST]
module.media_api.aws_api_gateway_method.options_uploads: Refreshing state... [id=agm-vtz8vfq85g-v3prx5-OPTIONS]
module.media_api.aws_api_gateway_method.get_uploads: Refreshing state... [id=agm-vtz8vfq85g-v3prx5-GET]
module.identity_pool.aws_cognito_identity_pool.main: Refreshing state... [id=ap-northeast-1:23316fc9-592e-4a7b-9a8a-c33a446faf78]
module.media_api.aws_iam_role_policy.get_upload_records_dynamodb: Refreshing state... [id=cloud-photos-dev-get-upload-records-role:dynamodb-query]
module.media_api.aws_iam_role_policy.create_upload_record_dynamodb: Refreshing state... [id=cloud-photos-dev-create-upload-record-role:dynamodb-put]
module.media_api.aws_lambda_function.create_upload_record: Refreshing state... [id=cloud-photos-dev-create-upload-record]
module.media_api.aws_lambda_function.delete_upload_record: Refreshing state... [id=cloud-photos-dev-delete-upload-record]
module.media_api.aws_lambda_function.get_upload_records: Refreshing state... [id=cloud-photos-dev-get-upload-records]
module.media_api.aws_iam_role_policy.delete_upload_record_dynamodb: Refreshing state... [id=cloud-photos-dev-delete-upload-record-role:dynamodb-delete]
module.media_api.aws_api_gateway_method.options_upload_item: Refreshing state... [id=agm-vtz8vfq85g-xbfdej-OPTIONS]
module.media_api.aws_api_gateway_method.delete_upload: Refreshing state... [id=agm-vtz8vfq85g-xbfdej-DELETE]
module.media_api.aws_api_gateway_method_response.options_uploads: Refreshing state... [id=agmr-vtz8vfq85g-v3prx5-OPTIONS-200]
module.media_api.aws_api_gateway_integration.options_uploads: Refreshing state... [id=agi-vtz8vfq85g-v3prx5-OPTIONS]
module.media_api.aws_api_gateway_method_response.options_upload_item: Refreshing state... [id=agmr-vtz8vfq85g-xbfdej-OPTIONS-200]
module.media_api.aws_api_gateway_integration.options_upload_item: Refreshing state... [id=agi-vtz8vfq85g-xbfdej-OPTIONS]
module.media_api.aws_api_gateway_integration_response.options_uploads: Refreshing state... [id=agir-vtz8vfq85g-v3prx5-OPTIONS-200]
module.media_api.aws_api_gateway_integration_response.options_upload_item: Refreshing state... [id=agir-vtz8vfq85g-xbfdej-OPTIONS-200]
module.identity_pool.aws_iam_role.authenticated: Refreshing state... [id=cloud-photos-cognito-authenticated-dev]
module.media_api.aws_lambda_permission.delete_upload: Refreshing state... [id=AllowAPIGatewayInvoke]
module.media_api.aws_api_gateway_integration.delete_upload: Refreshing state... [id=agi-vtz8vfq85g-xbfdej-DELETE]
module.media_api.aws_lambda_permission.post_uploads: Refreshing state... [id=AllowAPIGatewayInvoke]
module.media_api.aws_api_gateway_integration.post_uploads: Refreshing state... [id=agi-vtz8vfq85g-v3prx5-POST]
module.media_api.aws_lambda_permission.get_uploads: Refreshing state... [id=AllowAPIGatewayInvoke]
module.media_api.aws_api_gateway_integration.get_uploads: Refreshing state... [id=agi-vtz8vfq85g-v3prx5-GET]
module.media_api.aws_api_gateway_deployment.media: Refreshing state... [id=lq2p3l]
module.identity_pool.aws_cognito_identity_pool_roles_attachment.main: Refreshing state... [id=ap-northeast-1:23316fc9-592e-4a7b-9a8a-c33a446faf78]
module.identity_pool.aws_iam_role_policy.authenticated_api: Refreshing state... [id=cloud-photos-cognito-authenticated-dev:media-api-access]
module.media_api.aws_api_gateway_stage.media: Refreshing state... [id=ags-vtz8vfq85g-dev]
module.media_storage.aws_s3_bucket_versioning.media: Refreshing state... [id=***-cloud-photos-media-dev]
module.identity_pool.aws_iam_role_policy.authenticated_s3: Refreshing state... [id=cloud-photos-cognito-authenticated-dev:media-storage-access]
module.media_storage.aws_s3_bucket_public_access_block.media: Refreshing state... [id=***-cloud-photos-media-dev]
module.media_storage.aws_s3_bucket_server_side_encryption_configuration.media: Refreshing state... [id=***-cloud-photos-media-dev]
module.media_storage.aws_s3_bucket_lifecycle_configuration.media: Refreshing state... [id=***-cloud-photos-media-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # module.media_api.aws_api_gateway_gateway_response.default_4xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_4xx" {
        id                  = "aggr-vtz8vfq85g-DEFAULT_4XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_gateway_response.default_5xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_5xx" {
        id                  = "aggr-vtz8vfq85g-DEFAULT_5XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.push_notification.aws_secretsmanager_secret.firebase_credentials will be created
  + resource "aws_secretsmanager_secret" "firebase_credentials" {
      + arn                            = (known after apply)
      + description                    = "Firebase Admin SDK service account key for push notifications"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "cloud-photos-firebase-credentials-dev"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + region                         = "ap-northeast-1"
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }

      + replica (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

</details>


**Stderr:**
```

Error: operation error DynamoDB: DescribeTable, https response error StatusCode: 400, RequestID: QH9SNSSSQRLUIK7UGHKL59UCFFVV4KQNSO5AEMVJF66Q9ASUAAJG, api error AccessDeniedException: User: arn:aws:sts::***:assumed-role/gh-terraform-plan-dev/GitHubActions is not authorized to perform: dynamodb:DescribeTable on resource: arn:aws:dynamodb:ap-northeast-1:***:table/cloud-photos-device-tokens-dev because no identity-based policy allows the dynamodb:DescribeTable action

  with module.device_token_db.aws_dynamodb_table.device_tokens,
  on ../../modules/device_token_db/main.tf line 4, in resource "aws_dynamodb_table" "device_tokens":
   4: resource "aws_dynamodb_table" "device_tokens" {


```
<!-- terraform-plan-dev -->